RU09342/lab-4-timers-and-pwm-trebledawson/Software PWM/MSP430FR2311/main.c
#include <msp430.h>
#define LED1 BIT0;
#define BUTTON BIT1;

void LEDSetup();
void ButtonSetup();
void TimerB0Setup();
void TimerB1Setup();
unsigned int freqCalc(unsigned int number);

int main(void)
{
    WDTCTL = WDTPW | WDTHOLD;   // stop watchdog timer
    LEDSetup(); // Initialize our LEDS
    ButtonSetup();  // Initialize our button
    TimerB0Setup(); // Initialize Timer0
    __enable_interrupt(); // Interrupt enable

    while(1)
    {}
}

#pragma vector=TIMER0_B0_VECTOR // When TB0R reaches CCR0
__interrupt void led_period(void)
{
    P1OUT |= LED1;   // Turn P1.6 LED on
}

#pragma vector=TIMER0_B1_VECTOR // When TB0R reaches CCR1
__interrupt void led_off(void)
{
    P1OUT &= ~LED1; // Turn P1.6 LED off
    TB0IV = 0;
}

#pragma vector=PORT1_VECTOR   // Define interrupt vector, in this case Port 1
__interrupt void button_press(void) // Define interrupt function that runs whenever interrupt is detected
{
    P1IE &= !BUTTON; // Turn off P1.3 interrupt
    unsigned int pwm = TB0CCR0 / 10;
    if (TB0CCR1 <= (pwm * 9))
    {
        TB0CCR1 += pwm;
    }
    else
    {
        TB0CCR1 = 1;
    }

    TB1CTL = TBSSEL_1 + MC_1 + ID_3 + TBCLR; // Set Timer B0 to BCLK, up mode
    TB1CCTL0 = CCIE;  // Compare interrupt enable
    TB1CCR0 = 1000;  // Delay
}

#pragma vector=TIMER1_B0_VECTOR
__interrupt void button_debounce_timer(void)
{
    TB1CTL = MC_0;            // Halt timer
    TB1R = 0;                 // Reset count register
    P1IE |= BUTTON;            // Enable interrupt code
    P1IFG = ~BUTTON;            // Disable interrupt flag to re-enable interrupt
}

void LEDSetup()
{

    P1DIR |= LED1;   // Set P1.6 to output
    P1OUT &= ~LED1;  // Initialize P1.6 to off
}

void ButtonSetup()
{
    P1DIR &= ~BUTTON;            // Set P1.3 to input
    P1REN |= BUTTON;            // Set P1.3 resistor enable...
    P1OUT |= BUTTON;            // ...to enable pullup resistor
    P1IE |= BUTTON;             // Set P1.3 to be interrupt
    P1IES |= BUTTON;            // Set P1.3 to falling edge interrupt
}

void TimerB0Setup()
{
    TB0CTL = TBSSEL_2 + MC_1 + ID_3 + TBCLR; // Use SMCLK in up mode
    //static const unsigned int desired = 4; // Set desired initial frequency
                                              // f = 1 kHz
    //TB0CCR0 = freqCalc(desired); // counts = SMCLK / (2*desired)
    TB0CCR0 = 1000;
    TB0CCTL0 = CCIE;               // Enable capture/compare interrupt
                                   // Out mode 7, reset/set
    TB0CCTL1 = CCIE ;
    TB0CCR1 = TB0CCR0 / 2;           // Initialize TB0CCR1 to 50% of TB0CCR0
                                     // i.e., 50% PWM
}

unsigned int freqCalc(unsigned int desired)
{
    return 65536 / desired; //
}
